# StairsCrossingRisersDisallowedFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsCrossingRisersDisallowedFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Crossing risers are not allowed
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsCrossingRisersDisallowedFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsCrossingRisersDisallowedFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsCrossingRisersDisallowedFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace